# Parameter Filter Rule Factory Create Less Rule Method

Source: https://www.revitapidocs.com/2026/e3e590a8-7511-5182-7a84-959bd5f925e6.htm

---

| Parameter Filter Rule Factory Create Less Rule Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | CreateLessRule(ElementId, ElementId) | Creates a filter rule that determines whether ElementId values  from the document are less than a certain value. |
|  | CreateLessRule(ElementId, Int32\) | Creates a filter rule that determines whether integer values  from the document are less than a certain value. |
|  | CreateLessRule(ElementId, String) | Creates a filter rule that determines whether strings from the document  are less than a certain value. |
|  | CreateLessRule(ElementId, Double, Double) | Creates a filter rule that determines whether double\-precision values  from the document are less than a certain value. |

Top See Also

#### Reference

ParameterFilterRuleFactory Class Autodesk.Revit.DB Namespace